-- phpMyAdmin SQL Dump
-- version 3.4.3
-- http://www.phpmyadmin.net
--
-- Host: localhost
-- Generation Time: Aug 25, 2011 at 09:17 PM
-- Server version: 5.1.52
-- PHP Version: 5.2.16

SET SQL_MODE="NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;

--
-- Database: `luckyrabbit_production`
--

-- --------------------------------------------------------

--
-- Table structure for table `mm_materials`
--

CREATE TABLE IF NOT EXISTS `mm_materials` (
  `mtrId` int(6) unsigned zerofill NOT NULL AUTO_INCREMENT,
  `planId` int(6) unsigned zerofill NOT NULL,
  `type` char(100) NOT NULL,
  `mName` char(200) NOT NULL,
  `unit` char(100) NOT NULL,
  `spec` char(200) NOT NULL,
  `amount` decimal(12,2) NOT NULL,
  `amountc` decimal(12,2) DEFAULT NULL,
  `cost` decimal(12,2) DEFAULT NULL,
  `costTotal` decimal(12,2) DEFAULT NULL,
  `budget` decimal(12,2) DEFAULT NULL,
  `budgetTotal` decimal(12,2) DEFAULT NULL,
  `weight` decimal(12,2) DEFAULT NULL,
  `limitation` decimal(12,2) DEFAULT NULL,
  `inDate` date NOT NULL,
  `remark` text,
  PRIMARY KEY (`mtrId`),
  KEY `planId` (`planId`)
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 AUTO_INCREMENT=167 ;

--
-- Dumping data for table `mm_materials`
--

INSERT INTO `mm_materials` (`mtrId`, `planId`, `type`, `mName`, `unit`, `spec`, `amount`, `amountc`, `cost`, `costTotal`, `budget`, `budgetTotal`, `weight`, `limitation`, `inDate`, `remark`) VALUES
(000040, 000014, '钢材', '测试钢材', '100', '型号一', 100.00, NULL, NULL, NULL, NULL, NULL, 100.00, 100.00, '2011-01-01', '材料备注一'),
(000041, 000014, '钢材', '测试钢材二号', '200', '型号二', 200.00, NULL, NULL, NULL, NULL, NULL, 200.00, 200.00, '2011-01-02', '材料备注二'),
(000042, 000014, '水泥', '测试水泥', '100', '型号一', 100.00, NULL, NULL, NULL, NULL, NULL, 100.00, 100.00, '2011-01-01', '水泥备注一'),
(000043, 000015, '河沙', '测试河沙', '100', '型号一', 100.00, NULL, NULL, NULL, NULL, NULL, 100.00, 100.00, '2011-02-01', '河沙测试一'),
(000044, 000015, '石子', '测试石子', '100', '型号一', 100.00, NULL, NULL, NULL, NULL, NULL, 100.00, 100.00, '2011-02-01', '石子测试一'),
(000045, 000015, '水泥', '测试水泥', '100', '型号一', 100.00, NULL, NULL, NULL, NULL, NULL, 100.00, 100.00, '2011-02-01', '水泥一'),
(000046, 000016, '钢材', '测试钢材', '100', '型号一', 100.00, NULL, NULL, NULL, NULL, NULL, 100.00, 100.00, '2011-01-01', '材料备注一'),
(000047, 000016, '钢材', '测试钢材二号', '200', '型号二', 200.00, NULL, NULL, NULL, NULL, NULL, 200.00, 200.00, '2011-01-02', '材料备注二'),
(000048, 000016, '水泥', '测试水泥', '100', '型号一', 100.00, NULL, NULL, NULL, NULL, NULL, 100.00, 100.00, '2011-01-01', '水泥备注一'),
(000049, 000016, '河沙', '测试河沙', '100', '型号一', 100.00, NULL, NULL, NULL, NULL, NULL, 100.00, 100.00, '2011-02-01', '河沙测试一'),
(000050, 000016, '石子', '测试石子', '100', '型号一', 100.00, NULL, NULL, NULL, NULL, NULL, 100.00, 100.00, '2011-02-01', '石子测试一'),
(000051, 000016, '水泥', '测试水泥', '100', '型号一', 100.00, NULL, NULL, NULL, NULL, NULL, 100.00, 100.00, '2011-02-01', '水泥一'),
(000112, 000017, '钢材', '测试钢材', '100', '型号一', 100.00, NULL, NULL, NULL, NULL, NULL, 100.00, 100.00, '2011-01-01', '材料备注一'),
(000113, 000017, '钢材', '测试钢材二号', '200', '型号二', 200.00, NULL, NULL, NULL, NULL, NULL, 200.00, 200.00, '2011-01-02', '材料备注二'),
(000114, 000017, '水泥', '测试水泥', '100', '型号一', 100.00, NULL, NULL, NULL, NULL, NULL, 100.00, 100.00, '2011-01-01', '水泥备注一'),
(000115, 000017, '河沙', '测试河沙', '100', '型号一', 100.00, NULL, NULL, NULL, NULL, NULL, 100.00, 100.00, '2011-02-01', '河沙测试一'),
(000116, 000017, '石子', '测试石子', '100', '型号一', 100.00, NULL, NULL, NULL, NULL, NULL, 100.00, 100.00, '2011-02-01', '石子测试一'),
(000117, 000017, '水泥', '测试水泥', '100', '型号一', 100.00, NULL, NULL, NULL, NULL, NULL, 100.00, 100.00, '2011-02-01', '水泥一'),
(000118, 000018, '钢材', '测试钢材', '100', '型号一', 100.00, NULL, NULL, NULL, NULL, NULL, 100.00, 100.00, '2011-01-01', '材料备注一'),
(000119, 000018, '钢材', '测试钢材二号', '200', '型号二', 200.00, NULL, NULL, NULL, NULL, NULL, 200.00, 200.00, '2011-01-02', '材料备注二'),
(000120, 000018, '水泥', '测试水泥', '100', '型号一', 100.00, NULL, NULL, NULL, NULL, NULL, 100.00, 100.00, '2011-01-01', '水泥备注一'),
(000121, 000018, '河沙', '测试河沙', '100', '型号一', 100.00, NULL, NULL, NULL, NULL, NULL, 100.00, 100.00, '2011-02-01', '河沙测试一'),
(000122, 000018, '石子', '测试石子', '100', '型号一', 100.00, NULL, NULL, NULL, NULL, NULL, 100.00, 100.00, '2011-02-01', '石子测试一'),
(000123, 000018, '水泥', '测试水泥', '100', '型号一', 100.00, NULL, NULL, NULL, NULL, NULL, 100.00, 100.00, '2011-02-01', '水泥一'),
(000124, 000019, '钢材', '测试钢材', '100', '型号一', 100.00, NULL, NULL, NULL, NULL, NULL, 100.00, 100.00, '2011-01-01', '材料备注一'),
(000125, 000019, '钢材', '测试钢材二号', '200', '型号二', 200.00, NULL, NULL, NULL, NULL, NULL, 200.00, 200.00, '2011-01-02', '材料备注二'),
(000126, 000019, '水泥', '测试水泥', '100', '型号一', 100.00, NULL, NULL, NULL, NULL, NULL, 100.00, 100.00, '2011-01-01', '水泥备注一'),
(000127, 000019, '河沙', '测试河沙', '100', '型号一', 100.00, NULL, NULL, NULL, NULL, NULL, 100.00, 100.00, '2011-02-01', '河沙测试一'),
(000128, 000019, '石子', '测试石子', '100', '型号一', 100.00, NULL, NULL, NULL, NULL, NULL, 100.00, 100.00, '2011-02-01', '石子测试一'),
(000129, 000019, '水泥', '测试水泥', '100', '型号一', 100.00, NULL, NULL, NULL, NULL, NULL, 100.00, 100.00, '2011-02-01', '水泥一'),
(000130, 000020, '钢材', '测试钢材', '100', '型号一', 100.00, NULL, NULL, NULL, NULL, NULL, 100.00, 100.00, '2011-01-01', '材料备注一'),
(000131, 000020, '钢材', '测试钢材二号', '200', '型号二', 200.00, NULL, NULL, NULL, NULL, NULL, 200.00, 200.00, '2011-01-02', '材料备注二'),
(000132, 000020, '水泥', '测试水泥', '100', '型号一', 100.00, NULL, NULL, NULL, NULL, NULL, 100.00, 100.00, '2011-01-01', '水泥备注一'),
(000133, 000020, '河沙', '测试河沙', '100', '型号一', 100.00, NULL, NULL, NULL, NULL, NULL, 100.00, 100.00, '2011-02-01', '河沙测试一'),
(000134, 000020, '石子', '测试石子', '100', '型号一', 100.00, NULL, NULL, NULL, NULL, NULL, 100.00, 100.00, '2011-02-01', '石子测试一'),
(000135, 000020, '水泥', '测试水泥', '100', '型号一', 100.00, NULL, NULL, NULL, NULL, NULL, 100.00, 100.00, '2011-02-01', '水泥一'),
(000136, 000021, '钢材', '测试钢材', '100', '型号一', 100.00, NULL, NULL, NULL, NULL, NULL, 100.00, 100.00, '2011-01-01', '材料备注一'),
(000137, 000021, '钢材', '测试钢材二号', '200', '型号二', 200.00, NULL, NULL, NULL, NULL, NULL, 200.00, 200.00, '2011-01-02', '材料备注二'),
(000138, 000021, '水泥', '测试水泥', '100', '型号一', 100.00, NULL, NULL, NULL, NULL, NULL, 100.00, 100.00, '2011-01-01', '水泥备注一'),
(000139, 000021, '河沙', '测试河沙', '100', '型号一', 100.00, NULL, NULL, NULL, NULL, NULL, 100.00, 100.00, '2011-02-01', '河沙测试一'),
(000140, 000021, '石子', '测试石子', '100', '型号一', 100.00, NULL, NULL, NULL, NULL, NULL, 100.00, 100.00, '2011-02-01', '石子测试一'),
(000141, 000021, '水泥', '测试水泥', '100', '型号一', 100.00, NULL, NULL, NULL, NULL, NULL, 100.00, 100.00, '2011-02-01', '水泥一'),
(000142, 000021, '钢材', '测试钢材', '100', '型号一', 100.00, NULL, NULL, NULL, NULL, NULL, 100.00, 100.00, '2011-01-01', '材料备注一'),
(000143, 000022, '钢材', '测试钢材二号', '200', '型号二', 200.00, NULL, NULL, NULL, NULL, NULL, 200.00, 200.00, '2011-01-02', '材料备注二'),
(000144, 000022, '水泥', '测试水泥', '100', '型号一', 100.00, NULL, NULL, NULL, NULL, NULL, 100.00, 100.00, '2011-01-01', '水泥备注一'),
(000145, 000022, '河沙', '测试河沙', '100', '型号一', 100.00, NULL, NULL, NULL, NULL, NULL, 100.00, 100.00, '2011-02-01', '河沙测试一'),
(000146, 000022, '石子', '测试石子', '100', '型号一', 100.00, NULL, NULL, NULL, NULL, NULL, 100.00, 100.00, '2011-02-01', '石子测试一'),
(000147, 000022, '水泥', '测试水泥', '100', '型号一', 100.00, NULL, NULL, NULL, NULL, NULL, 100.00, 100.00, '2011-02-01', '水泥一'),
(000148, 000023, '钢材', '测试钢材', '100', '型号一', 100.00, NULL, NULL, NULL, NULL, NULL, 100.00, 100.00, '2011-01-01', '材料备注一'),
(000149, 000023, '钢材', '测试钢材二号', '200', '型号二', 200.00, NULL, NULL, NULL, NULL, NULL, 200.00, 200.00, '2011-01-02', '材料备注二'),
(000150, 000023, '水泥', '测试水泥', '100', '型号一', 100.00, NULL, NULL, NULL, NULL, NULL, 100.00, 100.00, '2011-01-01', '水泥备注一'),
(000151, 000023, '河沙', '测试河沙', '100', '型号一', 100.00, NULL, NULL, NULL, NULL, NULL, 100.00, 100.00, '2011-02-01', '河沙测试一'),
(000152, 000023, '石子', '测试石子', '100', '型号一', 100.00, NULL, NULL, NULL, NULL, NULL, 100.00, 100.00, '2011-02-01', '石子测试一'),
(000153, 000023, '水泥', '测试水泥', '100', '型号一', 100.00, NULL, NULL, NULL, NULL, NULL, 100.00, 100.00, '2011-02-01', '水泥一'),
(000154, 000024, '钢材', '测试钢材', '100', '型号一', 100.00, NULL, NULL, NULL, NULL, NULL, 100.00, 100.00, '2011-01-01', '材料备注一'),
(000155, 000024, '钢材', '测试钢材二号', '200', '型号二', 200.00, NULL, NULL, NULL, NULL, NULL, 200.00, 200.00, '2011-01-02', '材料备注二'),
(000156, 000024, '水泥', '测试水泥', '100', '型号一', 100.00, NULL, NULL, NULL, NULL, NULL, 100.00, 100.00, '2011-01-01', '水泥备注一'),
(000157, 000024, '河沙', '测试河沙', '100', '型号一', 100.00, NULL, NULL, NULL, NULL, NULL, 100.00, 100.00, '2011-02-01', '河沙测试一'),
(000158, 000024, '石子', '测试石子', '100', '型号一', 100.00, NULL, NULL, NULL, NULL, NULL, 100.00, 100.00, '2011-02-01', '石子测试一'),
(000159, 000024, '水泥', '测试水泥', '100', '型号一', 100.00, NULL, NULL, NULL, NULL, NULL, 100.00, 100.00, '2011-02-01', '水泥一'),
(000160, 000025, '钢材', '测试钢材', '100', '型号一', 100.00, NULL, NULL, NULL, NULL, NULL, 100.00, 100.00, '2011-01-01', '材料备注一'),
(000161, 000025, '钢材', '测试钢材二号', '200', '型号二', 200.00, NULL, NULL, NULL, NULL, NULL, 200.00, 200.00, '2011-01-02', '材料备注二'),
(000162, 000025, '水泥', '测试水泥', '100', '型号一', 100.00, NULL, NULL, NULL, NULL, NULL, 100.00, 100.00, '2011-01-01', '水泥备注一'),
(000163, 000025, '河沙', '测试河沙', '100', '型号一', 100.00, NULL, NULL, NULL, NULL, NULL, 100.00, 100.00, '2011-02-01', '河沙测试一'),
(000164, 000025, '石子', '测试石子', '100', '型号一', 100.00, NULL, NULL, NULL, NULL, NULL, 100.00, 100.00, '2011-02-01', '石子测试一'),
(000165, 000025, '水泥', '测试水泥', '100', '型号一', 100.00, NULL, NULL, NULL, NULL, NULL, 100.00, 100.00, '2011-02-01', '水泥一'),
(000166, 000025, '钢材', '测试钢材', '100', '型号一', 100.00, NULL, NULL, NULL, NULL, NULL, 100.00, 100.00, '2011-01-01', '材料备注一');

--
-- Constraints for dumped tables
--

--
-- Constraints for table `mm_materials`
--
ALTER TABLE `mm_materials`
  ADD CONSTRAINT `mm_materials_ibfk_1` FOREIGN KEY (`planId`) REFERENCES `mm_mplans` (`planId`) ON UPDATE CASCADE;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
